// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Anuluj";
"GOBACK_BUTTON"		= "Wróć";
"DIAGNOSE_BUTTON"	= "Diagnozuj";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Konfiguruję komputer...";
"MESSAGE_PREP_CONNECTION"	= "Przygotowuję połączenie...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Nieoczekiwany błąd";
"MESSAGE_FATAL_ERROR_TITLE"		= "Niestety, wystąpił nieoczekiwany błąd.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Błąd";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Niestety...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Niestety";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Uwaga";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Czy chcesz kontynuować?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Nie wszystkie wymagane informacje zostały podane";
"ERROR_MESSAGE_VALIDATION_0001" = "Sprawdź pola oznaczone czerwonymi strzałkami i podaj wymagane informacje.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Podany przez Ciebie tekst jest za krótki.";
"ERROR_MESSAGE_VALIDATION_0002" = "Sprawdź wyróżnione pole i popraw wprowadzony tekst.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "Podana przez Ciebie informacja jest niepoprawna.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Podana przez Ciebie nazwa użytkownika jest niepoprawna.";
"ERROR_MESSAGE_VALIDATION_0004" = "Sprawdź wyróżnione pole i podaj poprawną nazwę użytkownika dla sieci NetInfo.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "Podane przez Ciebie hasło jest niepoprawne.";
"ERROR_MESSAGE_VALIDATION_0005" = "Sprawdź wyróżnione pole i podaj poprawne hasło.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Podana przez Ciebie nazwa nie może zostać użyta.";
"ERROR_MESSAGE_VALIDATION_0006" = "Sprawdź wyróżnione pole i wybierz inną nazwę skróconą.";
"ERROR_MESSAGE_VALIDATION_0007" = "Już jest użytkownik o tej nazwie skróconej. Podaj inną nazwę skróconą.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "Podany adres IP jest pusty.";
"ERROR_MESSAGE_VALIDATION_0010" = "Podany adres IP zawiera niepoprawne znaki.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "Adres musi się składać z 4 segmentów."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Sprawdź wyróżnione pole i podaj poprawny adres. Jeśli nie znasz tych informacji, zapytaj administratora sieci.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "Adres musi się składać z 4 segmentów."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Sprawdź wyróżnione pole i podaj poprawny adres. Jeśli nie znasz tych informacji, zapytaj administratora sieci.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Każdy segment adresu musi się składać od 1 do 3 znaków."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Sprawdź wyróżnione pole i podaj poprawny adres. Jeśli nie znasz tych informacji, zapytaj administratora sieci.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "Podany adres nie jest dopuszczalny.";
"ERROR_MESSAGE_VALIDATION_0014" = "Sprawdź wyróżnione pole i podaj poprawny adres. Jeśli nie znasz tych informacji, zapytaj administratora sieci.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "Podana maska podsieci nie jest poprawna.";
"ERROR_MESSAGE_VALIDATION_0015" = "Sprawdź wyróżnione pole i podaj poprawną maskę podsieci. Jeśli nie znasz tych informacji, zapytaj administratora sieci.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Podana nazwa już istnieje w Twojej sieci NetInfo. Zlogowanie się do NetInfo przy jej użyciu nie będzie możliwe.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Nie możesz mieć tej samej wartości.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "Podane hasło jest niepoprawne.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Podany numer karty kredytowej nie może zostać użyty.";
"ERROR_MESSAGE_VALIDATION_0019" = "Sprawdź wyróżnione pole i podaj poprawny numer karty kredytowej.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Nazwa konta nie może zaczynać się od cyfry.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Podany adres email może być bezużyteczny.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "Adres IP oraz adres routera nie są spójne z podaną maską podsieci. Sprawdź poniższe pola i podaj poprawne wartości:\n     Adres IP\n     Maska podsieci\nJeśli nie znasz tych informacji, zapytaj administratora sieci.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Podana przez Ciebie nazwa nie może zostać użyta.";
"ERROR_MESSAGE_VALIDATION_0023" = "Sprawdź wyróżnione pole i wybierz inną nazwę.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Występują identyczne rzeczy.";
"ERROR_MESSAGE_VALIDATION_0024" = "Sprawdź wyróżnione pole i podaj niepowtarzalne wartości.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Modem nie może wykryć sygnału linii.";
"MESSAGE_NO_DIAL_TONE"					= "Upewnij się, czy modem jest podłączony i kliknij w OK. Lub kliknij w przycisk Poniecha, by wrócić i zaznaczyć kratkę „Ignoruj sygnał linii”.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Zakończ";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Hasła nie pokrywają się.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Sprawdź pola oznaczone czerwonymi strzałkami i podaj takie samo hasło w obu polach.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Podaj nazwę lokalizacji.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Tworzysz nową lokalizację sieciową, gdzie zachowane są informacje o konfiguracji sieci. Teraz musisz podać nazwę tej lokalizacji.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Podaj inną nazwę lokalizacji.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Podana nazwa lokalizacji już istnieje. Podaj inną nazwę.";


"MESSAGE_TASK_FORMAT" = "„%1$@ połączenie przez %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Bezprzewodowa";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Modem kablowy";
"CONNECTION_Lan" = "Sieć lokalna";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP z ID klienta";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "IP statyczne";

"MESSAGE_TITLE_CONFIGURE" = "Konfiguruję...";
"MESSAGE_FAILED_CONFIGURE" = "Konfigurowanie nie powiodło się.";
"MESSAGE_DONE_CONFIGURE" = "Zakończ konfigurowanie.";
"MESSAGE_CHECKING_CONNECTION" = "Sprawdzam połączenie sieciowe...";
"MESSAGE_CONNECTED" = "Połączenie sieciowe nawiązane.";
"MESSAGE_NOT_CONNECTED" = "Nie można nawiązać połączenia z siecią.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Komputer nie może połączyć się z Internetem. Kliknij w OK, aby wrócić i zmienić ustawienia sieciowe, i spróbuj ponownie.";

"DEFAULT_LOCATION_NAME" = "Lokalizacja (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";